[
  {
    "number": 1,
    "emoji": "⚛",
    "title": "Fundamentos de JavaScript (Pré-Requisitos)",
    "color": "amber",
    "commands": [
      {
        "cmd": "Variáveis e tipos de dados",
        "desc": "Aprenda como declarar variáveis em JavaScript usando `let` e `const` e entenda quando utilizar cada um. Explore também os tipos primitivos: `string` (texto), `number` (números), `boolean` (verdadeiro ou falso), `undefined` (valor indefinido), `null` (ausência intencional de valor), `symbol` (identificadores únicos) e `bigint` (para números muito grandes). Esses conceitos são fundamentais para a estruturação do seu código."
      },
      {
        "cmd": "Funções e escopos",
        "desc": "Saiba como declarar funções usando a palavra-chave `function` ou como funções anônimas (`arrow functions`). Entenda o conceito de escopo — onde as variáveis são visíveis e acessíveis — e as diferenças entre escopo global e local, além de como evitar conflitos ou vazamentos de variáveis."
      },
      {
        "cmd": "Arrays e objetos",
        "desc": "Os arrays permitem armazenar listas de dados e os objetos permitem estruturar dados em pares de chave e valor. Pratique métodos essenciais como `push`, `map`, `filter` e `reduce` para manipular arrays, e saiba como acessar e modificar propriedades e métodos dos objetos para organizar melhor seus dados."
      },
      {
        "cmd": "Promises e async/await",
        "desc": "JavaScript é assíncrono, ou seja, pode lidar com tarefas que demoram para responder (como chamadas de API). Aprenda a trabalhar com `Promises` para lidar com esses fluxos assíncronos, e como simplificar essa leitura usando a sintaxe `async/await` para escrever código mais claro e eficiente."
      },
      {
        "cmd": "Manipulação de DOM",
        "desc": "O DOM (Document Object Model) representa a estrutura HTML de uma página. Aprenda a acessar e alterar elementos usando `document.querySelector`, `innerHTML`, `classList`, entre outros métodos. Essa manipulação é essencial para interatividade e dinamicidade em páginas web."
      },
      {
        "cmd": "Módulos ES6+",
        "desc": "Organize melhor seu projeto utilizando `import` e `export` para dividir e reutilizar trechos de código em arquivos separados. Essa modularização aumenta a legibilidade e facilita a manutenção de grandes aplicações."
      }
    ]
  },
  {
    "number": 2,
    "emoji": "🟠",
    "title": "Primeiros Passos com React",
    "color": "orange",
    "commands": [
      {
        "cmd": "Conceito de SPA",
        "desc": "Uma Single Page Application (SPA) é um aplicativo web que carrega apenas uma vez e atualiza o conteúdo dinamicamente sem recarregar a página inteira. Isso resulta em navegação mais rápida, melhorando significativamente a experiência do usuário."
      },
      {
        "cmd": "O que é React e por que usá-lo",
        "desc": "React é uma biblioteca JavaScript criada pelo Facebook, usada para construir interfaces de usuário de forma reativa. Ele utiliza componentes reutilizáveis que melhoram a manutenção, escalabilidade e performance das aplicações."
      },
      {
        "cmd": "Instalação e criação de projeto",
        "desc": "Configure rapidamente um projeto React usando ferramentas como `npx create-react-app` ou `npm create vite@latest`. Essas ferramentas já fornecem estrutura básica, scripts de desenvolvimento e recursos essenciais para começar a codar sem preocupações iniciais."
      },
      {
        "cmd": "Estrutura de pastas e arquivos",
        "desc": "Entenda como um projeto React é organizado: a pasta `public` para arquivos estáticos (HTML, imagens), a pasta `src` para o código-fonte (componentes, estilos), o `index.html` como ponto de entrada e o `App.js` como componente principal."
      },
      {
        "cmd": "JSX",
        "desc": "JSX é uma extensão de sintaxe que permite escrever HTML dentro do JavaScript, tornando a construção de componentes visuais mais intuitiva. Ele é convertido para JavaScript puro por ferramentas como Babel, mantendo o projeto compatível com os navegadores."
      }
    ]
  },
  {
  "number": 2.5,
  "emoji": "🛠️",
  "title": "Ferramentas de Build e Bundling",
  "color": "gray",
  "commands": [
    {
      "cmd": "Webpack",
      "desc": "Empacotador de módulos robusto, padrão de mercado para aplicações React. Permite configurações detalhadas, otimização, minificação e integração com loaders (como Babel) e plugins. Ideal para projetos complexos e com muitas dependências.",
      "link": "https://dvalenascimento.github.io/webpackcheatsheet/"
    },
    {
      "cmd": "Vite",
      "desc": "Ferramenta moderna e ultrarrápida para desenvolvimento de aplicações. Usa ESBuild para transformar código instantaneamente, e oferece build final otimizado com Rollup. Ótimo para começar novos projetos React rapidamente.",
      "link": "https://dvalenascimento.github.io/vitecheatsheet/"
    },
    {
      "cmd": "Parcel",
      "desc": "Empacotador que funciona sem configuração inicial (zero-config). Simples e rápido para projetos de pequeno e médio porte. Detecta automaticamente arquivos como React, TypeScript, imagens, etc."
    },
    {
      "cmd": "Rollup",
      "desc": "Focado em bundles minimalistas, usado principalmente em bibliotecas React ou quando é preciso um bundle final muito pequeno. Tem tree-shaking eficiente e gera pacotes otimizados."
    },
    {
      "cmd": "Escolha certa para seu projeto",
      "desc": "Para projetos React de produção ou empresas, Webpack e Vite são as escolhas principais. Para bibliotecas e componentes compartilháveis, Rollup é ideal. Parcel é ótimo para quem quer começar rápido e simples!"
    }
  ]
},
  {
    "number": 3,
    "emoji": "🔵",
    "title": "Componentes",
    "color": "blue",
    "commands": [
      {
        "cmd": "Function Components",
        "desc": "Crie interfaces em React usando funções JavaScript que retornam JSX. Esses componentes são fáceis de entender, reutilizar e facilitam a composição de telas mais complexas."
      },
      {
        "cmd": "Props",
        "desc": "As `props` (propriedades) são dados que você pode passar para componentes filhos, tornando-os dinâmicos e reutilizáveis. Elas são a base para a comunicação entre componentes em React."
      },
      {
        "cmd": "useState",
        "desc": "O hook `useState` permite criar estados locais em componentes de função. Ele retorna um par: o valor atual do estado e uma função que o atualiza, disparando um novo render automático do componente."
      },
      {
        "cmd": "Eventos",
        "desc": "React usa eventos semelhantes ao JavaScript puro, mas com nomes em camelCase, como `onClick` e `onChange`. Esses eventos permitem capturar interações do usuário e atualizar o estado ou a interface."
      },
      {
        "cmd": "Listas e chaves",
        "desc": "Para renderizar listas de dados, use o método `map`. Cada elemento renderizado deve ter uma `key` única para que o React possa identificar e atualizar itens de forma eficiente, evitando problemas de performance."
      }
    ]
  },
  {
    "number": 4,
    "emoji": "🟣",
    "title": "Hooks Essenciais",
    "color": "purple",
    "commands": [
      {
        "cmd": "useState",
        "desc": "Retorna um par: o valor atual do estado e uma função para atualizá-lo. Essencial para armazenar valores dinâmicos dentro de componentes de função."
      },
      {
        "cmd": "useEffect",
        "desc": "Permite executar efeitos colaterais (como requisições de dados, animações ou alterações no DOM) após a renderização do componente. Ele substitui métodos de ciclo de vida em componentes de classe."
      },
      {
        "cmd": "Regras dos Hooks",
        "desc": "Hooks devem ser chamados apenas no topo de componentes de função ou em hooks customizados. Eles não devem ser usados dentro de loops, condicionais ou funções aninhadas, garantindo que a ordem de execução seja sempre a mesma."
      }
    ]
  },
  {
    "number": 5,
    "emoji": "🟡",
    "title": "Estilização",
    "color": "yellow",
    "commands": [
      {
        "cmd": "CSS Modules",
        "desc": "Permite escopar estilos CSS a um componente específico, evitando conflitos de nome de classes em grandes projetos. Cada arquivo CSS gera um objeto de classes com nomes únicos para uso em JSX."
      },
      {
        "cmd": "Styled Components",
        "desc": "Uma biblioteca para escrever CSS dentro de JavaScript, criando componentes estilizados e dinâmicos. Ela facilita a aplicação de temas e a composição de estilos, melhorando a manutenção do código."
      },
      {
        "cmd": "Tailwind CSS",
        "desc": "Um framework utilitário que oferece classes pré-definidas para construir layouts responsivos e consistentes. Ele economiza tempo, pois evita a escrita de CSS do zero e garante consistência visual."
      },
      {
        "cmd": "Component libraries",
        "desc": "Bibliotecas como Material UI ou Ant Design oferecem componentes visuais prontos, consistentes e personalizáveis, acelerando o desenvolvimento e garantindo uma experiência de usuário profissional."
      }
    ]
  },
  {
    "number": 6,
    "emoji": "🟠",
    "title": "Gerenciamento de Estado Global",
    "color": "orange",
    "commands": [
      {
        "cmd": "Context API",
        "desc": "Recurso do React que permite compartilhar dados entre múltiplos componentes sem passar props manualmente por todos eles (props drilling). Ideal para dados globais como tema, idioma ou usuário logado."
      },
      {
        "cmd": "Redux",
        "desc": "Biblioteca externa que oferece um fluxo de dados previsível usando actions e reducers. Ideal para gerenciar estados complexos em aplicações grandes, mantendo consistência e facilitando o debug."
      },
      {
        "cmd": "Alternativas modernas",
        "desc": "Bibliotecas como Zustand e Recoil surgiram para oferecer soluções de estado global mais leves, com APIs mais simples e menor sobrecarga para projetos que não precisam da complexidade do Redux."
      }
    ]
  },
  {
    "number": 7,
    "emoji": "🟡",
    "title": "Consumo de APIs",
    "color": "yellow",
    "commands": [
      {
        "cmd": "Fetch e Axios",
        "desc": "Duas formas principais de fazer requisições HTTP em JavaScript. `fetch` é nativo e simples, enquanto `axios` tem recursos avançados como interceptadores, suporte a requisições simultâneas e melhores mensagens de erro."
      },
      {
        "cmd": "useEffect + useState",
        "desc": "Combine esses hooks para buscar dados de APIs: useEffect para acionar a busca no momento certo e useState para armazenar o resultado, atualizando a interface automaticamente."
      },
      {
        "cmd": "Tratamento de erros e loading",
        "desc": "Implemente estados para controlar a exibição de mensagens de carregamento (`loading`) e lidar com falhas de rede (`error`), melhorando a experiência do usuário em casos de demora ou erros na conexão."
      }
    ]
  },
  {
    "number": 8,
    "emoji": "🔴",
    "title": "Rotas (React Router)",
    "color": "red",
    "commands": [
      {
        "cmd": "Instalação e configuração",
        "desc": "Use `npm install react-router-dom` ou `yarn add react-router-dom` para instalar a biblioteca de roteamento e configure o `BrowserRouter` no topo da árvore de componentes para ativar o sistema de rotas."
      },
      {
        "cmd": "Componentes principais",
        "desc": "Use os componentes `<Routes>` e `<Route>` para definir quais componentes devem ser exibidos em quais URLs, permitindo navegação fluida e declarativa no app."
      },
      {
        "cmd": "Roteamento dinâmico",
        "desc": "Use `useParams` para capturar parâmetros da URL (como IDs) e `useSearchParams` para manipular buscas e filtros na barra de endereços, personalizando a experiência do usuário."
      },
      {
        "cmd": "Rotas privadas",
        "desc": "Proteja áreas sensíveis do app criando componentes de autenticação que redirecionam usuários não logados ou sem permissões, garantindo segurança e controle de acesso."
      }
    ]
  },
  {
    "number": 9,
    "emoji": "🔵",
    "title": "Componentes Avançados e Padrões",
    "color": "blue",
    "commands": [
      {
        "cmd": "Refs e useRef",
        "desc": "Use o `useRef` para criar referências a elementos do DOM (foco, rolagem) ou armazenar valores persistentes entre renderizações sem disparar re-renderizações."
      },
      {
        "cmd": "Memoization",
        "desc": "Use técnicas como `React.memo`, `useMemo` e `useCallback` para otimizar a performance do app, evitando renderizações desnecessárias de componentes ou cálculos complexos em cada atualização."
      },
      {
        "cmd": "Render Props e HOC",
        "desc": "Padrões que permitem compartilhar lógica entre componentes: Render Props passa funções como filhos, e HOC (Higher Order Component) envolve componentes para estender suas funcionalidades."
      },
      {
        "cmd": "Lazy loading",
        "desc": "Use `React.lazy` e `<Suspense>` para carregar componentes sob demanda, diminuindo o tamanho do bundle inicial e acelerando o carregamento do app para o usuário."
      }
    ]
  },
  {
    "number": 10,
    "emoji": "⚫",
    "title": "Testes",
    "color": "black",
    "commands": [
      {
        "cmd": "Jest + React Testing Library",
        "desc": "Ferramentas líderes para testes unitários e de integração em React. O Jest executa os testes e fornece ferramentas de mock e asserção, enquanto a React Testing Library foca na simulação de interações reais do usuário."
      },
      {
        "cmd": "Testes de componentes",
        "desc": "Assegure que componentes renderizam corretamente e respondem como esperado a interações (cliques, mudanças de input, etc.)."
      },
      {
        "cmd": "Testes de integração",
        "desc": "Valide fluxos mais amplos (como um formulário completo), garantindo que diferentes partes do app trabalham juntas como deveriam em um cenário real."
      }
    ]
  },
  {
    "number": 11,
    "emoji": "⚡",
    "title": "Performance e Otimização",
    "color": "yellow",
    "commands": [
      {
        "cmd": "Code splitting",
        "desc": "Quebre o código do aplicativo em pedaços menores usando `import()` dinâmico. Isso faz com que partes do app sejam carregadas apenas quando necessárias, reduzindo o tempo de carregamento inicial e melhorando a experiência do usuário."
      },
      {
        "cmd": "Evitar re-renderizações",
        "desc": "Use `React.memo` para componentes que recebem as mesmas props e `useMemo`/`useCallback` para memorizar valores e funções. Essas técnicas evitam que partes da interface sejam re-renderizadas sem necessidade, economizando recursos."
      },
      {
        "cmd": "Otimização de renderizações",
        "desc": "Estruture bem seus componentes, evite cálculos pesados dentro do render e mantenha a árvore de componentes enxuta. Isso ajuda o React a atualizar a interface de forma mais rápida e eficiente."
      }
    ]
  },
  {
    "number": 12,
    "emoji": "🚀",
    "title": "Deploy e Produção",
    "color": "green",
    "commands": [
      {
        "cmd": "Deploy em Vercel, Netlify",
        "desc": "Essas plataformas permitem que você hospede seu projeto React de forma gratuita e com integração contínua, facilitando o lançamento de novas versões e atualizações automáticas a partir do repositório."
      },
      {
        "cmd": "Variáveis de ambiente",
        "desc": "Configure chaves e variáveis sensíveis como APIs e tokens de forma segura usando arquivos `.env`. Isso separa configurações de produção e desenvolvimento, evitando exposições acidentais de dados."
      },
      {
        "cmd": "PWA e SEO básico",
        "desc": "Transforme sua aplicação em um Progressive Web App (PWA), permitindo que ela funcione offline e seja instalada como um app no celular. Além disso, configure tags básicas de SEO (título, descrição) para melhorar a visibilidade em motores de busca."
      }
    ]
  },
  {
    "number": 13,
    "emoji": "🌟",
    "title": "Avançando Além",
    "color": "pink",
    "commands": [
      {
        "cmd": "Next.js",
        "desc": "Um framework que combina React com Server-Side Rendering (SSR) e geração estática de páginas, melhorando a performance e o SEO do seu projeto. É ideal para apps que precisam ser rápidos e amigáveis a motores de busca."
      },
      {
        "cmd": "React Native",
        "desc": "Use a mesma base de React para criar aplicativos móveis nativos para Android e iOS. Ideal para quem quer expandir o app web para o mobile, compartilhando lógica e experiência de desenvolvimento."
      },
      {
        "cmd": "Frameworks modernos",
        "desc": "Explore novas ferramentas como Remix (com foco em performance e UX) e Astro (para sites estáticos e ultra rápidos), ampliando seu repertório de tecnologias e aprendizados."
      }
    ]
  },
  {
    "number": 14,
    "emoji": "💡",
    "title": "Dicas Finais",
    "color": "gray",
    "commands": [
      {
        "cmd": "Prática constante",
        "desc": "A melhor forma de aprender e consolidar conceitos é criar projetos reais: experimente ideias, refaça exemplos e brinque com os conceitos para reforçar sua confiança e criatividade no desenvolvimento."
      },
      {
        "cmd": "Projetos sugeridos",
        "desc": "Alguns exemplos de projetos simples, mas muito úteis para treinar: um To-Do List com adição e remoção de tarefas; um app que consome dados de uma API e exibe resultados; ou a cópia de alguma interface famosa para praticar estilos e responsividade."
      }
    ]
  }
]
